engineering/doc/FLY-1439-receipt-producer-acceptance/evidence/q7-mutations/X2-settle-write-ahead-removed.diff
 external_plugins/discord/chat-receipt-runtime.ts | 2 +-
 1 file changed, 1 insertion(+), 1 deletion(-)
diff --git a/external_plugins/discord/chat-receipt-runtime.ts b/external_plugins/discord/chat-receipt-runtime.ts
index ea2e324..e460504 100644
--- a/external_plugins/discord/chat-receipt-runtime.ts
+++ b/external_plugins/discord/chat-receipt-runtime.ts
@@ -208,7 +208,7 @@ export class ChatReceiptRuntime {
         attempts: 0,
         advisedAt: null,
       }
-      writeJsonAtomic(path, intent)
+      // MUT: write-ahead removed
       intentWritten = true
     } catch (error) {
       this.log(`settle recovery write failed for ${messageId}: ${errorText(error)}`)
